
#work with file
#აუცილებლად უნდა გახსნა და დახურო რადგან პროგრამა უფრო ჩქარა იმუშაოს

data = input("whrite text:")

file = open("data/text.txt", "w")#იხსნება ფაილი და თუ არ გაქ შექმნილი მაშინ შეიქმნება

# w - წერის გახსნა, ფაილის შინაარსი წაიშლება, თუ ფაილი არ არსებობს, იქმნება ახალი.
# r - გახსენით კითხვისთვის (არის ნაგულისხმევი მნიშვნელობა).
# x - გახსენით წერა, თუ ფაილი არ არსებობს, წინააღმდეგ შემთხვევაში გამონაკლისი დააგდეს.
# a - გახსნა უნდა ჩაიწეროს, ინფორმაცია ემატება ფაილის ბოლოს.
# b - გახსნა ორობითი რეჟიმში.
# t - ტექსტის რეჟიმში გახსნა (არის ნაგულისხმევი მნიშვნელობა).
# + - კითხვისა და წერის გახსნა

file.write(data + "\n")
file.write("!!!")

file.close()

print(" ") 

file = open("data/text.txt", "r")

print(file.read())# თუ მივუთითებთ პარამეტრებს ფჩხილებში მაშინ მაგდენ სიმბლოს გამოიტასნ და თუ ცარიელია მაშინ ყველაფერს გამოიტანს

print(" ") 


for line in file:
    print(line, end="")


file.close()