import time, datetime as d, sys, os, platform # , შექგვიძლია გამოვყოთ ერთმანეთისგან რამოდენიმე მოდილი ესეგი ამის გამო შევიძლეა 1 ხაზში დავაიმპორტიროთ(დავამატოთ) რამოდენიმე მოდული

print(d.datetime.now().time().hour)

print(sys.path)# ეს არის sys-ს. ეს ფუნქცია გვიჩვენებს რა გაზა უნდა გამიაროს ამ ფაილამდე რომ რამე დაპრინტოს ამ ფაილში

print(os.name)# ეს გვიჩვენებს ოპერაციული სისტემის სახელს ოღონდ გამოყავს ცოტა უცნაყრად(მაგ: nt, posix)

print(platform.system())# ეს გვიჩვენებს ოპერაციული სისტემის სახელს (მაგ: Windows, Linux, Mac)